       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN-PROGRAM.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 WS-SUM UNSIGNED-INT.
           01 MULTI-SUM UNSIGNED-INT.
           01 SQR-SUM UNSIGNED-INT.
       PROCEDURE DIVISION.
           CALL "ADD" USING 1 2 WS-SUM.
           DISPLAY WS-SUM.
           CALL "MULTIPLY" USING 2 2 MULTI-SUM.
           DISPLAY MULTI-SUM.
           CALL "SQUARE" USING 3 SQR-SUM.
           DISPLAY SQR-SUM.
