       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUB-PROGRAM.
           PROCEDURE DIVISION.
           DISPLAY "Thank you main-program!".
           DISPLAY "I am the sub-program.".
