       IDENTIFICATION DIVISION.     
       PROGRAM-ID. MyCelebrator.
       PROCEDURE DIVISION.
           DISPLAY "I'm alright though, it's pretty cool this COBOL stu"
           "ff isn't it. I'm not sure what the weather is going to be l"
           "ike tomorrow though?".
