       IDENTIFICATION DIVISION.     
       PROGRAM-ID. Valentine.
       PROCEDURE DIVISION.
           DISPLAY "Happy Valentine's Day.".
           DISPLAY "How was your day?".
           
